Documents/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриемНаРаботу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КадроваяИстория</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КадроваяИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПриемНаРаботу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // Проверка 1: дата приёма не меньше даты документа
    Если ЗначениеЗаполнено(ДатаПриема) И ДатаПриема < НачалоДня(Дата) Тогда
        Сообщить("Ошибка: дата приёма не может быть меньше даты документа!", СтатусСообщения.Важное);
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Проверка 2: должность действующая
    Если Должность.Действующая = Ложь Тогда
        Сообщить("Ошибка: должность является недействующей!", СтатусСообщения.Важное);
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Проверка 3: ищем любую запись о приёме этого сотрудника 
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    КадроваяИстория.Регистратор
        |ИЗ
        |    РегистрСведений.КадроваяИстория КАК КадроваяИстория
        |ГДЕ
        |    КадроваяИстория.Сотрудник = &Сотрудник
        |    И КадроваяИстория.Уволен = ЛОЖЬ
        |    И КадроваяИстория.Регистратор <> &ТекущийДокумент";
    
    Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
    Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
    
    Если НЕ Запрос.Выполнить().Пустой() Тогда
        Сообщить("Ошибка: сотрудник уже принят на работу!", СтатусСообщения.Важное);
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Записываем движение
    Движения.КадроваяИстория.Записывать = Истина;
    
    Движение = Движения.КадроваяИстория.Добавить();
    Движение.Период    = ДатаПриема;
    Движение.Сотрудник = Сотрудник;
    Движение.Отдел     = Отдел;
    Движение.Должность = Должность;
    Движение.Оклад     = Оклад;
    Движение.Уволен    = Ложь;
    
КонецПроцедуры
